Autodesk.Revit.DB.FormatStatus
Remarks:
The character formatting includes
BoldItalicUnderlineSuperScriptSubscriptAll Caps
Since:
2017
An enumerated type indicating the formatting status of a range of characters
in FormattedText
Since:
2017

Autodesk.Revit.DB.FormatStatus.Mixed
The characters in the format have mixed formatting.

Autodesk.Revit.DB.FormatStatus.All
All of the characters in the range have the specified format.

Autodesk.Revit.DB.FormatStatus.None
None of the characters in the range has the specified format.